Revit 2025 API
ReinforcementSettings.NumberVaryingLengthRebarsIndividually Property
 Use this option to modify the way varying length bars are numbered (individually or as a whole).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public bool NumberVaryingLengthRebarsIndividually { get; set; }
Public Property NumberVaryingLengthRebarsIndividually As Boolean
	Get
	Set
public:
property bool NumberVaryingLengthRebarsIndividually {
	bool get ();
	void set (bool value);
}
member NumberVaryingLengthRebarsIndividually : bool with get, set
Property Value
Boolean
Remarks
 If this property is true, then the Revit numbering mechanism (NumberingSchema) will assign a number to each bar in a rebar set with varying lengths. It will also assign a number to the sets that don't have varying length bars. The number is assigned based on the Revit numbering logic. (For example if two bars are identical, they will receive the same number). The numbering mechanism will compare varying bars with other varying or uniform bars within the project. (i.e each bar in a varying set is interpreted as an individual Rebar).
The shape parameters of a Rebar can be accessed via [!:Autodesk::Revit::DB::Structure::RebarShapeDefinition::getParameters] method.
The parameters at a specific index in a Rebar set can be accessed via [!:Autodesk::Revit::DB::Structure::Rebar::getParameterValueAtIndex] method.
 If this property is false, the following happens:
1. The Revit numbering mechanism (NumberingSchema) will assign a unique number for each Rebar set which has varying length bars. Each bar within the varying set will have(share) the same number that was assigned for the entire set. Even if two varying Rebar sets are identical, they will be assigned different numbers.
2. Each bar within a set with varying length bars will also be assigned a suffix parameter (REBAR_NUMBER_SUFFIX). This suffix parameter will receive values based on the RebarVaryingLengthNumberSuffix property.
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace